DAY_FORMS = ["день", "дня", "дней"]
MONTH_FORMS = ["месяц", "месяца", "месяцев"]
YEAR_FORMS = ["год", "года", "лет"]
HOUR_FORMS = ["час", "часа", "часов"]
MINUTE_FORMS = ["минуту", "минуты", "минут"]
SECOND_FORMS = ["секунду", "секунды", "секунд"]

FLEXIBLE_TIME_RESPONSES = [
    "Никогда",
    "Завтра",
    "Потом",
    "Когда-нибудь",
    "Сегодня",
    "Послезавтра",
    "Скоро",
    "Сейчас",
    "Скоро, но это не точно",
]

TIME_UNIT_OPTIONS = [DAY_FORMS, MONTH_FORMS, YEAR_FORMS, HOUR_FORMS, MINUTE_FORMS, SECOND_FORMS]
WHEN_RESPONSES = [FLEXIBLE_TIME_RESPONSES, TIME_UNIT_OPTIONS]

QUANTITY_RESPONSES = ["Много", "Нисколько", "Мало", "Очень много", "Жесть как мало", "Не мало"]

INSULT_FALLBACKS = [
    "Не пиши сюда больше",
    "Ну и зачем ты это высрал?",
    "Чо случилось?",
    "Иди нахуй",
    "Ой, такая острая шутка! Я прям порезался!",
    "За такие шутки, в зубах бывают промежутки",
    "Заткнись",
    "От тебя говной воняет, даже по интернету чувствую",
    "Такой ты смешной(нет)",
    "Выйди с чата",
]
